Tekla.Structures.Drawing.Image.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,System.String)
Creates a new Image instance with the given parameters.
view: The view to be used.
insertionPoint: The insertion point to be used.
fileName: The filename to be used.
Throws System.IO.FileNotFoundException: Thrown if the specified file does not exist.

Tekla.Structures.Drawing.Image.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,System.String,Tekla.Structures.Drawing.EmbeddedObjectAttributes)
Creates a new Image instance using the specified attributes.
view: The view to be used.
insertionPoint: The insertion point to be used.
fileName: The filename to be used.
attributes: The attributes to be used.
Throws System.IO.FileNotFoundException: Thrown if the specified file does not exist.

Tekla.Structures.Drawing.Image.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.Size,System.String)
Creates a new Image instance with the given parameters.
view: The view to be used.
insertionPoint: The insertion point to be used.
frameSize: The frames size.
fileName: The filename to be used.
Throws System.IO.FileNotFoundException: Thrown if the specified file does not exist.

Tekla.Structures.Drawing.Image.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.Size,System.String,Tekla.Structures.Drawing.EmbeddedObjectAttributes)
Creates a new Image instance using the specified attributes.
view: The view to be used.
insertionPoint: The insertion point to be used.
frameSize: The frames size.
fileName: The filename to be used.
attributes: The attributes to be used.
Throws System.IO.FileNotFoundException: Thrown if the specified file does not exist.